Repository: AbuBasssam/weather_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# home_page_title
source: Home Page
ar: الصفحة الرئيسية

# home_page_body
source: Enter Your Location to See the Forecast
ar: أدخل موقعك لرؤية التوقعات

# last_updated_text
source: Updated at
ar: تم التحديث في

# search_page_title
source: Search City
ar: أدخل اسم المدينة

# text_field_hint_text
source: Enter city name
ar: الرجاء إدخال اسم المدينة المطلوبة

# text_field_label_text
source: Search
ar: بحث

# no_internet_error
source: Please check your internet connection and try again
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى

# bad_request_1003_error
source: Parameter 'q' not provided.
ar: لم يتم توفير المتغيرات المطلوبة

# bad_request_1005_error
source: API request url is invalid.
ar: عنوان غير صالح

# bad_request_1006_error
source: No location found matching parameter 'q'
ar: لم يتم العثور على الموقع

# bad_request_9000_error
source: Json body passed in bulk request is invalid. Please make sure it is valid json with utf-8 encoding.
ar: جسم الـ JSON المرسل في الطلب الجماعي غير صالح. يرجى التأكد من أنه JSON صالح مع ترميز UTF-8

# bad_request_9001_error
source: Json body contains too many locations for bulk request. Please keep it below 50 in a single request
ar: يحتوي جسم الـ JSON على العديد من المواقع في الطلب الجماعي. يرجى الحفاظ على العدد أقل من 50 في الطلب الواحد

# bad_request_9999_error
source: Internal application error
ar: خطأ داخلي في التطبيق

# unauthorized_1002
source: API key not provided.
ar: لم يتم توفير مفتاح API

# unauthorized_2006
source: API key provided is invalid
ar: مفتاح API المقدم غير صالح

# forbidden_2007_error
source: API key has exceeded calls per month quota.
ar: مفتاح API قد تجاوز الحصة الشهرية للمكالمات

# forbidden_2008_error
source: API key has been disabled.
ar: تم تعطيل مفتاح API

# forbidden_2009_error
source: API key does not have access to the resource. Please check pricing page for what is allowed in your API subscription plan.
ar: مفتاح API ليس لديه حق الوصول إلى المورد. يرجى التحقق من صفحة التسعير لمعرفة ما هو مسموح به في خطة اشتراك API الخاصة بك

source: Sunny
ar: مشمس

source: Clear
ar: صافي

source: Partly cloudy
ar: غائم جزئيا

source: Cloudy
ar: غائم

source: Overcast
ar: ملبَد بالغيوم

source: Mist
ar: سديم

source: Patchy rain possible
ar: أمطار متفاوتة قريبة

source: Patchy snow possible
ar: ثلوج متفاوتة قريبة

source: Patchy sleet possible
ar: صقيع متفاوت قريب

source: Patchy freezing drizzle possible
ar: رذاذ متجمِد متفاوت قريب

source: Thundery outbreaks possible
ar: عواصف رعديَة في المناطق المجاورة

source: Blowing snow
ar: هبَات من الثلوج

source: Blizzard
ar: عاصفة ثلجيَة

source: Fog
ar: ضباب

source: Freezing fog
ar: ضباب متجمِد

source: Patchy light drizzle
ar: رذاذ خفيف متفاوت

source: Light drizzle
ar: رذاذ خفيف متفاوت

source: Freezing drizzle
ar: رذاذ متجمِد

source: Heavy freezing drizzle
ar: رذاذ متجمِد شديد

source: Patchy light rain
ar: أمطار خفيفة متفاوتة

source: Light rain
ar: أمطار خفيفة

source: Moderate rain at times
ar: أمطار معتدلة أحياناً

source: Moderate rain
ar: أمطار معتدلة

source: Heavy rain at times
ar: أمطار شديدة أحياناً

source: Heavy rain
ar: أمطار شديدة

source: Light freezing rain
ar: أمطار متجمِدة خفيفة

source: Moderate or heavy freezing rain
ar: أمطار متجمِدة معتدلة أو شديدة

source: Light sleet
ar: صقيع خفيف

source: Moderate or heavy sleet
ar: صقيع معتدل أو شديد

source: Patchy light snow
ar: ثلوج خفيفة متفاوتة

source: Light snow
ar: ثلوج خفيفة

source: Patchy moderate snow
ar: ثلوج معتدلة متفاوتة

source: Moderate snow
ar: ثلوج معتدلة

source: Patchy heavy snow
ar: ثلوج شديدة متفاوتة

source: Heavy snow
ar: ثلوج شديدة

source: Ice pellets
ar: حبيبات جليدية

source: Light rain shower
ar: زخَات خفيفة من الأمطار

source: Moderate or heavy rain shower
ar: زخَات معتدلة أو شديدة من الأمطار

source: Torrential rain shower
ar: زخَات غزيرة من الأمطار

source: Light sleet showers
ar: زخَات خفيفة من الصقيع

source: Moderate or heavy sleet showers
ar: زخَات معتدلة أو شديدة من الصقيع

source: Light snow showers
ar: زخَات خفيفة من الثلوج

source: Moderate or heavy snow showers
ar: زخَات معتدلة أو شديدة من الثلوج

source: Light showers of ice pellets
ar: زخَات خفيفة من الحبيبات الجليديَة

source: Moderate or heavy showers of ice pellets
ar: زخَات معتلة أو شديدة من الحبيبات الجليديَة

source: Patchy light rain with thunder
ar: أمطار خفيفة متفاوتة في المنطقة مع رعد

source: Moderate or heavy rain with thunder
ar: أمطار معتدلة أو شديدة في المنطقة مع رعد

source: Patchy light snow with thunder
ar: ثلوج خفيفة متفاوتة في المنطقة مع رعد

source: Moderate or heavy snow with thunder
ar: ثلوج معتدلة أو شديدة في المنطقة مع رعد

# error_message_header
source: Error
ar: خطا

# uncatched_exception
source: An unexpected error occurred. Please contact support if the issue persists
ar: حدث خطأ غير متوقع. يرجى الاتصال بالدعم إذا استمرت المشكلة
